Repository: CloudCityNG/eduTrac
Catalog: eduTrac/Locale/*/LC_MESSAGES/eduTrac.po
Languages: it_it

source: LEC
it_it: LEC Lettura

source: LEC Lecture
it_it: LEC Lettura

source: LAB
it_it: LL Lettura + Lab

source: LAB Lab
it_it: LL Lettura + Lab

source: SEM Seminar
it_it: SEM Seminario

source: LL Lecture + Lab
it_it: LL Lettura + Lab

source: LS Lecture + Seminar
it_it: LS Lettura + Seminario

source: SL Seminar + Lab
it_it: SL Seminario + Lab

source: LLS Lecture + Lab + Seminar
it_it: LLS Lettura + Lab + Seminario

source: D Drop
it_it: D Scendere

source: W Withdrawn
it_it: W Ritirato

source: C Cancelled
it_it: C Cancellato

source: A Active
it_it: A Attivo

source: P Potential
it_it: P Potenziale

source: C Changed Mind
it_it: C Cambia decisione

source: G Graduated
it_it: G Laureato

source: I Institutional
it_it: I istituzionale

source: TR Transfer
it_it: TR Trasferire

source: X Exempt
it_it: X Esente

source: FR Freshman
it_it: FR Matricola

source: UG Undergraduate Student
it_it: UG Studente Universitario

source: GR Grad Student
it_it: GR Grado Studente

source: PhD PhD Student
it_it: PhD PhD Studente

source: FF First Time Freshman
it_it: FF Prima Immatricolazione

source: RA Readmit
it_it: RA Riammesso

source: NA Non-Applicable
it_it: NA Non Applicabile

source: Asset
it_it: Attività

source: Liability
it_it: Responsabilità

source: Equity
it_it: Equità

source: Revenue
it_it: Reddito

source: Expense
it_it: Spese

source: Hey admin, there is a new eduTrac update.
it_it: Ehi admin, c'è un nuovo aggiornamento eduTrac.

source: Click here
it_it: Clicca qui

source: Cancel
it_it: Cancella

source: You are here
it_it: Tu sei qui

source: Submit
it_it: Invia

source: Subject:
it_it: Materie

source: Message:
it_it: Messaggio:

source: Search Application
it_it: Cerca Applicazione

source: Create Application
it_it: Crea Applicazione

source: Address
it_it: Indirizzo

source: Academic Program
it_it: Programma Accademico

source: Start Term
it_it: Inzio sessione

source: Admit Status
it_it: Stato Ammissione

source: Insitution Attended
it_it: Istituzione frequentata

source: Institution
it_it: Istituzione

source: Attended From Date
it_it: Frequenta da Data

source: Attended To Date
it_it: Frequenta a Data

source: Save
it_it: Salva

source: Application
it_it: Applicazione

source: Person ID
it_it: Utente ID

source: Name
it_it: Nome

source: Actions
it_it: Azioni

source: Action
it_it: Azione

source: Process
it_it: Processo

source: Search Course
it_it: Cerca Corso

source: Create Course
it_it: Crea Corso

source: Add Course
it_it: Add Corso

source: Department
it_it: Dipartimento

source: Subject
it_it: Materie

source: Course Level
it_it: Livello Corso

source: Short Title
it_it: Titolo breve

source: Long Title
it_it: Titolo lungo

source: Course Number
it_it: Numero Corso

source: Effective Date
it_it: Data effettiva

source: End Date
it_it: Data fine

source: Credits
it_it: Crediti

source: Academic Level
it_it: Livello Accademico

source: Status
it_it: Stato

source: Status Date
it_it: Data Stato

source: Approval Person
it_it: Approvazione Utente

source: Approval Date
it_it: Data approvazione

source: Course Description
it_it: Descrizione Corso

source: View Course
it_it: Vedi Corso

source: Additional Course Info:
it_it: Ulteriori Info Corso

source: Prerequisites
it_it: Prerequisiti

source: Allow Audit
it_it: Consenti Revisione

source: Yes
it_it: Si

source: Allow Waitlist
it_it: Consenti lista di attesa

source: Minimum Enrollment
it_it: Iscrizione Minima

source: Seating Capacity
it_it: Posti a sedere

source: Courses
it_it: Corsi

source: Course Code
it_it: Codice Corso

source: Course:
it_it: Corso:

source: Last Update
it_it: Ultimo Update

source: Additional Info
it_it: Ulteriori Info

source: Add Cron Job
it_it: Add Crono Lavoro

source: Script to Run
it_it: Script per eseguire

source: Job Name
it_it: Nome Lavoro

source: Minutes
it_it: Minuti

source: Hourly
it_it: Ore

source: Daily
it_it: Giorno

source: Weekly
it_it: Settimana

source: How Often?
it_it: Quanto Frequente?

source: Until I Delete It
it_it: Fino a quando Io cancello

source: Only Once, Then Delete The Job
it_it: Solo una volta, poi eliminare il lavoro

source: Last Fired
it_it: Ultimo Fired

source: Next Execution
it_it: Prossima esecuzione

source: Interval
it_it: Intervallo

source: View Cron Job
it_it: Vedi Crono Lavoro

source: Latest 7 Media News
it_it: Ultime 7 novità

source: Calendar
it_it: Calendario

source: Event Name
it_it: Lista Eventi

source: Description
it_it: Descrizione

source: Room
it_it: Classe

source: Date
it_it: Frequentato a Data

source: Start Time
it_it: Inizio periodo

source: End Time
it_it: Fine periodo

source: Repeat?
it_it: Ripetere?

source: Repeat Occurrence
it_it: Ripetere Evento

source: Every Day
it_it: Ogni Giorno

source: Every Two Weeks
it_it: Ogni 2 settimane

source: Support
it_it: Supporto

source: Community Support Site
it_it: Sito Comunity Support

source: Online Documentation
it_it: Documentazione Online

source: Error!
it_it: Errore!

source: The system was unable to register you for the requested course section. Please <a onclick="history.go(-1);"><font color="orange">go back</font></a> and try again.
it_it: Il sistema non è riuscito a registrare voi per la sezione di corso richiesto. Si prega <a onclick="history.go(-1);"> <font color="orange"> tornare </ font> </ a> e riprovare.

source: Sorry but the system could not delete the record you requested. Please go back and try again. If the issue persists, contact the system administrator.
it_it: Spiacente, ma il sistema non è riuscito a eliminare il record che hai richiesto. Si prega di tornare indietro e provare di nuovo. Se il problema persiste, contattare l'amministratore di sistema.

source: The system was unable to write your update to the database. Please go back, try again, or contact your system administrator if the problem persists.
it_it: Il sistema è stato in grado di scrivere il vostro aggiornamento al database. Si prega di tornare indietro, riprovare oppure contattare l'amministratore di sistema se il problema persiste.

source: The file you tried to upload is not a .csv file. Please <a onclick="history.go(-1);"><font color="orange">go back</font></a> and try again.
it_it: Il file si è tentato di caricare non è un file. Csv. Si prega <a onclick="history.go(-1);"> <font color="orange"> tornare </ font> </ a> e riprovare.

source: Ouch!
it_it: Ohi!

source: It seems the page you are looking for is not here anymore. The page might have moved to another address or just removed by our staff.
it_it: Sembra che la pagina che stai cercando non è più qui. La pagina potrebbe essere trasferito a un altro indirizzo o appena tolto dal nostro staff.

source: Let us know
it_it: Fateci sapere

source: Go back to
it_it: Torna indietro

source: Browse through our
it_it: Sfoglia la nostra

source: The record your are looking for does not exist. Please try again.
it_it: Il record che state cercando non esiste. Riprova.

source: String
it_it: Stringa

source: File
it_it: Il nome del file non è valido

source: Line Number
it_it: Numero Linea

source: Delete
it_it: Cancella

source: There was an error with trying to extract your data. Either you need to run the Purge screen or check your saved query for errors.
it_it: Si è verificato un errore cercando di estrarre i dati. O si deve eseguire il comando ELIMINA o screen check tua ricerca salvato per gli errori.

source: Sorry, was unable to purge the current NSLC date. Please go back and try again.
it_it: Spiacenti, non era in grado di eliminare la data NSLC corrente. Si prega di tornare indietro e provare di nuovo.

source: Population was either null or you were trying to choose two populations at the same time. Please <a onclick="history.go(-1);"><font color="orange">go back</font></a> and try again.
it_it: Popolazione era nullo o si cercasse di scegliere due popolazioni allo stesso tempo. Si prega <a onclick="history.go(-1);"> <font color="orange"> tornare </ font> </ a> e riprovare.

source: There was an error with trying to reset the password. Please go back and try again.
it_it: C'è stato un errore con il tentativo di reimpostare la password. Si prega di tornare indietro e provare di nuovo.

source: The system was unable to write your entry to the database. This error usually occurs when there were no changes made to a record, and you clicked the save button. If this is not the case, please go back, try again, or contact your system administrator if the problem persists.
it_it: Il sistema non è riuscito a scrivere la sua entrata nel database. Questo errore si verifica in genere quando non c'erano le modifiche apportate a un record, e si fa clic sul pulsante Salva. Se questo non è il caso, si prega di tornare indietro, riprovare oppure contattare l'amministratore di sistema se il problema persiste.

source: You save list could not be written to the database. Please go back and try again.
it_it: Si salva elenco non poteva essere scritto nel database. Si prega di tornare indietro e provare di nuovo.

source: The screen
it_it: Il record è stato cancellato con successo. Utilizzare il menu di navigazione in alto per passare a una nuova schermata.

source: You are restricted from using certain keywords and characters in your select queries. Please go back back and try again.
it_it: Si sta l'uso di determinate parole chiave e personaggi dei tuoi query di selezione. Si prega di tornare indietro e riprovare.

source: Sorry but the system was unable to update the requested record. Please go back and try again.
it_it: Spiacente, ma il sistema non è riuscito ad aggiornare il record richiesto. Si prega di tornare indietro e provare di nuovo.

source: Search Faculty
it_it: Cerca Facoltà

source: Add Faculty
it_it: Add Facoltà

source: Faculty
it_it: Facoltà

source: Office
it_it: Ufficio

source: Office Phone
it_it: Telefono Ufficio

source: School
it_it: Scuola

source: I Inactive
it_it: I Inattivo

source: Approved By
it_it: Approvato da

source: Last Name
it_it: Nome

source: First Name
it_it: Cognome

source: View Faculty
it_it: Vedi Facoltà

source: &copy; 2013
it_it: &copy; 2014

source: Academic Year
it_it: Anno Accademico

source: Acad Year
it_it: Anno Accademico

source: Academic Year Code
it_it: Codice Anno Accademico

source: Building Code
it_it: Codice Edificio

source: Building Name
it_it: Nome Edificio

source: CCD Code
it_it: CCD Codice

source: CCD Name
it_it: CCD Nome

source: CIP Code
it_it: CIP Codice

source: CIP Name
it_it: CIP Nome

source: Class Year
it_it: Anno Classe

source: Minimum Credits
it_it: Crediti minimi

source: Maximum Credits
it_it: Crediti massimi

source: Credit Load
it_it: Credito Caricato

source: Cred Load Name
it_it: Nome Credito caricato

source: Credit Load Code
it_it: Codice credito caricato

source: Credit Load Name
it_it: Nome credito caricato

source: Degree
it_it: Laurea

source: Degree Code
it_it: Codice Laurea

source: Degree Name
it_it: Nome Laurea

source: Department Code
it_it: Codice Dipartimento

source: Department Type
it_it: Tipo Dipartimento

source: Department Name
it_it: Nome Dipartimento

source: Short Description
it_it: Descrizione Breve

source: Department Description
it_it: Descrizione Dipartimento

source: FICE Code
it_it: FICE Codice

source: Institution Name
it_it: Nome Istituzione

source: City
it_it: Città

source: State/Province
it_it: Stato/Provincia

source: Location
it_it: Posizione

source: Location Code
it_it: Codice Posizione

source: Location Name
it_it: Nome Posizione

source: Room Code
it_it: Codice Aula

source: Room Number
it_it: Numero Aula

source: Semester
it_it: Semestre

source: School Name
it_it: Nome Scuola

source: School Code
it_it: Codice Scuola

source: Semester Code
it_it: Codice Semestre

source: Start Date
it_it: Inizio periodo

source: Active
it_it: Attivo

source: Specialization
it_it: Specializzazione

source: Specialization Code
it_it: Codice Specializzazione

source: Specialization Name
it_it: Nome Specializzazione

source: Subject Code
it_it: Codice Materia

source: Subject Name
it_it: Nome Materia

source: Term
it_it: Periodo

source: Term Code
it_it: Codice Periodo

source: Reporting Term
it_it: Rapporto Periodo

source: Drop/Add End Date
it_it: Drop/Add Data fine

source: View Academic Year
it_it: Vedi Anno Accademico

source: View Building
it_it: Vedi Building

source: View CCD
it_it: Vedi CCD

source: View CIP
it_it: Vedi CIP

source: View Class Year
it_it: (CLYR) - Anno Classe

source: View Degree
it_it: Vedi Laurea

source: View Department
it_it: Vedi Dipartimento

source: View Deparment
it_it: Vedi Dipartimento

source: View Institution
it_it: Vedi Istituzione

source: View Location
it_it: Vedi Posizione

source: View Room
it_it: Vedi Aula

source: View School
it_it: Vedi Scuola

source: View Semester
it_it: Semestre

source: Specialization List
it_it: Lista Specializzazione

source: View Specialization
it_it: Vedi Specializzazione

source: View Subject
it_it: Vedi Materie

source: View Term
it_it: Vedi Periodo

source: Screens
it_it: Gestione

source: Administrative
it_it: Amministrazione

source: Forms
it_it: Moduli

source: (SEM) - Semester
it_it: (SEM) - Semestre

source: (TERM) - Term
it_it: (TERM) - Sessione

source: (AYR) - Academic Year
it_it: (AYR) - Anno Accademico

source: (DEPT) - Department
it_it: (DEPT) - Dipartimento

source: (SUBJ) - Subject
it_it: (SUBJ) - Materie

source: (CRL) - Credit Load
it_it: (CRL) - Carica Crediti

source: (CLYR) - Class Year
it_it: (CLYR) - Classe Anno

source: (DEG) - Degree
it_it: (DEG) - Laurea

source: (SPEC) - Specialization
it_it: (SPEC) - Specializzazione

source: (LOC) - Location
it_it: (LOC) - Posizione

source: (ROOM) - Room
it_it: (ROOM) - Aula

source: (SCH) - School
it_it: (SCH) - Scuola

source: Acad Program
it_it: Programma Accademico

source: (PROG) - Program
it_it: (PROG) - Programma

source: (APRG) - New Program
it_it: (APRG) - Nuovo Programma

source: Course
it_it: Corso

source: (CRSE) - Course
it_it: (CRSE) - Corso

source: (ACRS) - New Course
it_it: (ACRS) - Nuovo Corso

source: Course Section
it_it: Corso sezione

source: (SECT) - Section
it_it: (SECT) - Sezione

source: (RGN) - Register
it_it: (RGN) - Registra

source: (BRGN) - Batch Register
it_it: (BRGN) - Batch Registra

source: My Course Sections
it_it: Sezione miei corsi

source: (INST) - Institution
it_it: (INST) - Istituzione

source: (AINST) - New Institution
it_it: (AINST) - Nuova Istituzione

source: Person
it_it: Utente

source: (NAE) Search
it_it: (NAE) Cerca

source: (APER) Add Person
it_it: (APER) Add Utente

source: (FAC) Faculty
it_it: (FAC) Facoltà

source: Parent
it_it: Parente

source: Search
it_it: Cerca

source: Parent/Child Connect
it_it: Parente/Studente Connect

source: Student
it_it: Studente

source: (SPRO) Student Profile
it_it: (SPRO) Profilo Studente

source: Graduate Student(s)
it_it: Studente(s) Laureato

source: Generate Transcript
it_it: Genera Trascrizione

source: Student Portal
it_it: Portale Studente

source: Parent Portal
it_it: Portale Parente

source: Profile
it_it: Profilo

source: edit
it_it: Edita

source: Switch Back to
it_it: Tornare alla

source: Sign Out
it_it: Esci

source: Select file
it_it: Seleziona file

source: Change
it_it: Cambia

source: Remove
it_it: Rimuovi

source: Student Acad Cred
it_it: Crediti Accademici Studente

source: Student Acad Level
it_it: Livello accademico studente

source: Student Course Section
it_it: Sezione Corso Studente

source: Student Program
it_it: Programma Studente

source: Student Term
it_it: Periodo Studente

source: Student Term GPA
it_it: Periodo Studente GPA

source: Student Term Load
it_it: Periodo Studente Caricato

source: eduTrac
it_it: Gestione Didattica

source: Remember me
it_it: Ricordami

source: Sign in
it_it: Entra

source: Having troubles?
it_it: Hai problemi?

source: warning
it_it: Attenzione!

source: Install Tables
it_it: Installa Tables

source: Site Title
it_it: Titolo Sito

source: Your E-mail
it_it: La tua E-mail

source: Search Institution
it_it: Cerca Istituzione

source: Add Institution
it_it: Add Istituzione

source: Type
it_it: Tipo

source: University
it_it: Università

source: Institution Type
it_it: Tipo Istituzione

source: UNIV University
it_it: UNIV Università

source: Child's ID
it_it: Allievo ID

source: Parent/Child Connection
it_it: Parente/Allievo Connect

source: Parent ID
it_it: Parente ID

source: Child ID
it_it: Allievo ID

source: Connect
it_it: Connetti

source: Grades
it_it: Livelli

source: Grades for
it_it: Livelli per

source: Title
it_it: Titolo

source: Grade
it_it: Livello

source: Search Parent
it_it: Cerca Parente

source: Hello Parent!
it_it: Hello Parente

source: Welcome to the parent portal. The parent portal allows you to see your child's final grades and progress reports.
it_it: Benvenuti nel portale parente. Il portale permette di vedere voti finali del vostro bambino e relazioni.

source: Child(ren)
it_it: Allievi

source: Progress Report List
it_it: Report lista Progressi

source: Progress Reports
it_it: Report Progressi

source: Child Name
it_it: Nome Allievo

source: Teacher
it_it: Docente

source: View Parent
it_it: Vedi Parente

source: Phone
it_it: Telefono

source: Inactive
it_it: Inattivo

source: View Progress Report
it_it: Vedi report progressi

source: View Progress Report for
it_it: Vedi report progressi per

source: Course Title
it_it: Titolo Corso

source: Behavior
it_it: Comportamento

source: Assignments
it_it: Assegnazioni

source: Notes
it_it: Note

source: Manage Permissions
it_it: Manager Permessi

source: Add Permission
it_it: Add Permesso

source: Permissions
it_it: Permessi

source: Edit
it_it: Edita

source: New Permision
it_it: Nuovo Permesso

source: View Permission
it_it: Vedi Permesso

source: Name & Address
it_it: Nome e Indirizzo

source: Person Type
it_it: Tipo Utente

source: Miss.
it_it: Sig.rina

source: Mrs.
it_it: Sig.ra

source: Mr.
it_it: Sig.

source: Address1
it_it: Indirizzo1

source: Address2
it_it: Indirizzo2

source: Zip Code
it_it: Codice Corso

source: Country
it_it: Paese

source: Primary/Preferred Email
it_it: Principale/Preferita Email

source: Other
it_it: Altro

source: Date of Birth
it_it: Data Nascita

source: Gender
it_it: Sesso

source: Male
it_it: Maschio

source: Female
it_it: Femmina

source: Emergency Contact
it_it: Contatto Emergenza

source: Emergency Contact Phone
it_it: Contatto telefonico emergenza

source: Approved Date
it_it: Data Approvazione

source: Search Person
it_it: Cerca Utente

source: Address Summary
it_it: Sommario Indirizzo

source: Edit Address
it_it: Edita Indirizzo

source: Address Type
it_it: Tipo indirizzo

source: Add Date
it_it: Add Data

source: Added By
it_it: Aggiunto da

source: Extension
it_it: Estensione

source: Business
it_it: Lavoro

source: Cellular
it_it: Cellulare

source: Primary Email
it_it: Email Principale

source: Secondary Email
it_it: Email Secondaria

source: Manage Person Permissions
it_it: Manage Permessi Utente

source: Manage Permissions for -
it_it: Gestire le autorizzazioni per -

source: Permission
it_it: Autorizzazione

source: Manage Person Role
it_it: Gestisci Ruolo Utente

source: Manage Role for -
it_it: Gestire ruolo per -

source: Role
it_it: Ruolo

source: Member
it_it: Membro

source: Not Member
it_it: Non Membro

source: View Person
it_it: Vedi Utente

source: Person:
it_it: Utente:

source: User Profile
it_it: Profilo Utente

source: Search Program
it_it: Cerca Programma

source: Create Program
it_it: Crea Programma

source: Add Academic Program
it_it: Add Programma Accademico

source: Program Code
it_it: Codice Programma

source: Dept/Div
it_it: Dip/Div

source: Effective Catalog Year
it_it: Catalogo Effettivo Anno

source: Program Title
it_it: Titolo Programma

source: View Program
it_it: Vedi Programma

source: Reservation Categories
it_it: Categorie Prenotazione

source: Category Name
it_it: Nome Categoria

source: Category
it_it: Categoria

source: Room Reservation Settings
it_it: Prenotazione

source: Week Start
it_it: Inizio periodo

source: Monday
it_it: Lunedi

source: Sunday
it_it: Domenica

source: Enable Email
it_it: Abilita Email

source: Reply To Email
it_it: Rispondi to Email

source: Manage Roles
it_it: Gestisci ruolo

source: Add Role
it_it: Add Ruolo

source: Role Name
it_it: Nome Ruolo

source: Allow
it_it: Consenti

source: Deny
it_it: Nega

source: Ignore
it_it: Ignora

source: New Role
it_it: Nuovo Ruolo

source: Edit Role
it_it: Edita Ruolo

source: Save Query
it_it: Salva Query

source: Save Query Name
it_it: Salva Nome Query

source: Auto Purge
it_it: Auto elimina

source: If enabled, saved queries get purged every 30 days. If you use your saved query on a regular basis, you should set this option to no.
it_it: Se abilitata, query salvate vengono eliminati ogni 30 giorni. Se si utilizza la query salvata su base regolare, è necessario impostare questa opzione su n.

source: Saved Query Name
it_it: Nome Query salvata

source: Creation Date
it_it: Data Creazione

source: Saved Queries
it_it: Salva Queries

source: View Saved Query
it_it: Vedi Query salvata

source: Search Section
it_it: Cerca Sezione

source: Create Section
it_it: Crea Sezione

source: Section
it_it: Sezione

source: Section Start/End
it_it: Start/End Sezione

source: View Section
it_it: Vedi Sezione

source: Additional Section Info:
it_it: Ulteriori Info Sezione

source: Instructor
it_it: Docente

source: Section Type
it_it: Sezione Tipo

source: Instructor Method
it_it: Metodo Docente

source: Contact Hours
it_it: Orario di contatto

source: Instructor Load
it_it: Docente Caricato

source: Attendance
it_it: Frequenza

source: Attendance for
it_it: Frequenza per

source: Today's Date
it_it: Frequentato a Data

source: Student ID
it_it: Studente ID

source: Student Name
it_it: Nome Studente

source: Absent
it_it: Assente

source: Present
it_it: Presente

source: Attendance Report
it_it: Repot Frequenza

source: Batch Registration
it_it: Batch Registrazione

source: Course Sec ID
it_it: Corso Sez ID

source: You can find the id of a course section by visiting the
it_it: Potete trovare l'id di una sezione naturalmente visitando il

source: search
it_it: Cerca

source: screen for sections. The id is the first column in the table from the search result.
it_it: schermo per le sezioni. L'ID è la prima colonna della tabella dai risultati della ricerca.

source: Course Fee
it_it: Costo Corso

source: Lab Fee
it_it: Costo Lab

source: Course Materials Fee
it_it: Costo Materiale Corso

source: Course Sections
it_it: Sezione corsi

source: Section Code
it_it: Codice Sezione

source: Sections
it_it: Sezioni

source: Offering Info
it_it: Info Offerta

source: Offering Info:
it_it: Info Offerta:

source: Class Room
it_it: Aula Classe

source: Meeting Days
it_it: Giorni Incontro

source: Tuesday
it_it: Martedì

source: Wednesday
it_it: Mercoledì

source: Thursday
it_it: Giovedì

source: Friday
it_it: Venerdì

source: Saturday
it_it: Sabato

source: Register Online
it_it: Registra online

source: Submit Progress Report
it_it: Invia Repot Progressi

source: Course Registration
it_it: Registrazione Corso

source: My Courses
it_it: I miei Corsi

source: Course Section Roster
it_it: Roster sezione Corso

source: Academic Credit Status
it_it: Stato Crediti Accademici

source: Current Term
it_it: Periodo Corrente

source: Search Staff
it_it: Cerca Staff

source: View Staff
it_it: Vedi Staff

source: Search Student
it_it: Cerca Studente

source: Academic Credits
it_it: Crediti Accademici

source: Course Sec Name
it_it: Nome sez. Corso

source: Add Student
it_it: Add Studente

source: Program
it_it: Programma

source: Prog Start Date
it_it: Data inizio Programma

source: Catalog Year
it_it: Catalogo Anno

source: Grad Date
it_it: Dati Livello

source: Add Student Program
it_it: Add Programma Studente

source: Search Courses
it_it: Cerca Corsi
