Repository: CloudCityNG/eduTrac
Catalog: eduTrac/Locale/*/LC_MESSAGES/eduTrac.po
Languages: it_it

source: Course Sec Code
it_it: Codice Sez. Corso

source: Time
it_it: Tempo

source: My Grades
it_it: Mio Livello

source: Graduation Date
it_it: Dati Laurea

source: Hello Student!
it_it: Hello Studente

source: Welcome to the student portal. From here, you can view and print your class schedule, view grades, request transcripts, and register for courses.
it_it: Benvenuti nel portale dello studente. Da qui, è possibile visualizzare e stampare l'orario delle lezioni, vista gradi, richiesta di trascrizioni, e iscriversi ai corsi.

source: Class Schedule
it_it: Orario Classe

source: Schedule
it_it: Orario

source: View Student
it_it: Vedi Studente

source: View Academic Credits
it_it: Vedi Crediti Accademici

source: Course ID
it_it: Corso ID

source: Course Name
it_it: Nome Corso

source: Reporting term
it_it: Riporta Periodo

source: Status Time
it_it: Stato Tempo

source: Edit Student Program
it_it: Edita Programma Studente

source: Ant Grad Date
it_it: Ant Livello Dati

source: The record was deleted successfully. Use the navigation above to navigate to a new screen.
it_it: Il record è stato cancellato con successo. Utilizzare il menu di navigazione in alto per passare a una nuova schermata.

source: Records were purged successfully. You may continue with the NSLC process.
it_it: Record sono stati eliminati con successo. Si può continuare con il processo NSLC.

source: You progress was submitted successfully. Also, the parent will receive an email alerting to the new progress report.
it_it: Il tuo progresso è stato presentato con successo. Inoltre, il genitore riceverà una e-mail di avviso per la nuova relazione.

source: The password for the requested user has been reset. They should also receive an email address with their new password as well.
it_it: È stata reimpostata la password per l'utente richiesto. Dovrebbero anche ricevere un indirizzo e-mail con la nuova password.

source: The data was saved successfully to the database.
it_it: I dati sono stati salvati correttamente al database.

source: The save list
it_it: L'elenco salvataggio

source: The requested record was updated successfully.
it_it: Il record richiesto è stato aggiornato con successo.

source: Warning!
it_it: Attenzione!

source: click here
it_it: Clicca qui

source: This is the help page.
it_it: Questa è la pagina di aiuto.

source: Your message has been sent and someone will contact you as soon as possible.
it_it: Il tuo messaggio è stato inviato e qualcuno vi contatterà appena possibile.

source: Sorry, all fields must be filled in before you can submit the form.
it_it: Siamo spiacenti, tutti i campi devono essere compilati prima di poter inviare il modulo.

source: Sorry, your topic could not be posted. Please try again.
it_it: Spiacenti, l'argomento non può essere pubblicato. Riprova.

source: You forgot to choose a message to delete. Go back and try again.
it_it: Hai dimenticato di scegliere un messaggio da eliminare. Torna indietro e riprovare.

source: Sorry, your reply could not be updated.
it_it: Spiacente, la risposta non potrebbe essere aggiornato.

source: Message successfully sent!
it_it: Messaggio inviato con successo!

source: Error, couldn't send PM. Maybe wrong user.
it_it: Errore, non poteva inviare PM. User forse sbagliato.

source: Message successfully deleted!
it_it: Messaggio cancellato con successo!

source: Error, couldn't delete PM!
it_it: Errore, non poteva eliminare PM!

source: Your new member has been added and was sent an email with new account details.
it_it: Il vostro nuovo membro è stato aggiunto ed è stata inviata una mail con nuovi dettagli dell'account.

source: Sorry, the new user could not be added. Please try again.
it_it: Spiacenti, il nuovo utente non può essere aggiunto. Riprova.

source: Your news posting has been deleted. Go back to your the main news page.
it_it: La tua notizia distacco è stato cancellato. Torna alla tua pagina principale notizia.

source: You forgot to choose a news posting to delete. Go back to the main news page and try again.
it_it: Hai dimenticato di scegliere un distacco di notizie da eliminare. Torna alla pagina principale di notizie e riprovare.

source: The user has been updated successfully.
it_it: L'utente è stato aggiornato con successo.

source: The user was not updated, please try again.
it_it: L'utente non è stato aggiornato, riprova.

source: News item updated successfully.
it_it: Notizia aggiornata correttamente.

source: An error occurred. Please check your post and try again.
it_it: Si è verificato un errore. Si prega di controllare il tuo post e riprovare.

source: The file you are trying to upload is not a .zip file. Please try again.
it_it: Il file che si sta tentando di caricare non è un file zip.. Riprova.

source: Your plugin was uploaded and installed properly.
it_it: Il tuo plugin è stato caricato e installato correttamente.

source: There was a problem uploading your plugin. Please try again or check the plugin package.
it_it: C'è stato un problema di caricamento del plugin. Riprovare o controllare il pacchetto plugin.

source: The re-install was successful.
it_it: La re-installazione ha avuto successo.

source: There was an error with the re-install. It is better that you download the full version and overwrite the files on your server manually.
it_it: C'è stato un errore con la re-installazione. E 'meglio scaricare la versione completa e sovrascrivere i file sul vostro server manualmente.

source: Your system was upgraded to the latest version.
it_it: Il sistema è stato aggiornato alla versione più recente.

source: There was an error upgrading to the latest version. It is better that you download the full version and overwrite the files on your server manually.
it_it: Si è verificato un errore nell'aggiornamento alla versione più recente. E 'meglio scaricare la versione completa e sovrascrivere i file sul vostro server manualmente.

source: Sorry, your user type was not added. Please try again.
it_it: Spiacenti, il tuo tipo di utente non è stato aggiunto. Riprova.

source: There was an error uploading the file, please try again!
it_it: Si è verificato un errore durante il caricamento del file, riprova!

source: File name is not valid or the file was more than
it_it: Il nome del file non è valido

source: You profile was updated successfully.
it_it: Il profilo è stato aggiornato con successo.

source: Your profile could not be updated. Please try again.
it_it: Il tuo profilo non può essere aggiornato. Riprova.

source: Your password has been updated.
it_it: La tua password è stata aggiornata.

source: Sorry, your password cannot be blank.
it_it: Spiacenti, la password non può essere vuota.

source: The project has been added.
it_it: È stato aggiunto al progetto.

source: Project name, description, type, and email must be filled out before submitting the form.
it_it: Nome del progetto, la descrizione, il tipo e-mail devono essere compilati prima di inviare il modulo.

source: Your project has been updated.
it_it: Il progetto è stato aggiornato.

source: Your project was unable to be updated. Please try again.
it_it: Il progetto non è stato aggiornato. Riprova.

source: Your username or password was entered incorreclty. Please go back and try again.
it_it: Il tuo nome utente o la password non è corretta. Si prega di tornare indietro e provare di nuovo.

source: Unable to establish a database connection.
it_it: Impossibile stabilire una connessione al database.
